package handler;

public abstract class Constants
{
	//上发串口温度XFP标识
	public static final byte TEMP_TAG1 = (byte) 0xF1;
	public static final byte TEMP_TAG2 = (byte) 0xF2;
	public static final byte TEMP_TAG3 = (byte) 0xF3;
	public static final byte TEMP_TAG4 = (byte) 0xF4;
	
	//高温警报温度阈值
	public static int TEMP_ALARM_THRO = 50;
	
	//读取通道号标识
	public static final byte  CH_READ_TAG = (byte) 0xFE;
	
	//读取ONU注册状态标识
	public static final byte ONU1_REG_TAG = (byte)0x21;
	public static final byte ONU2_REG_TAG = (byte)0x22;
	public static final byte ONU3_REG_TAG = (byte)0x23;
	public static final byte ONU4_REG_TAG = (byte)0x24;
}
/**
下发0x10：关闭4213#1。
下发0x11：关闭1412#1。
下发0x12：关闭4213#2。
下发0x13：关闭1412#2。
下发0x14：关闭4213#3。
下发0x15：关闭1412#3。
下发0x16：关闭4213#4。
下发0x17：关闭1412#4。
/////////////////////////
下发0x00：开启4213#1。
下发0x01：开启1412#1。
下发0x02：开启4213#2。
下发0x03：开启1412#2。
下发0x04：开启4213#3。
下发0x05：开启1412#3。
下发0x06：开启4213#4。
下发0x07：开启1412#4。
/////////////////////////
下发0x21：将4213#1配置到No.1通道。
下发0x22：将4213#1配置到No.2通道。
下发0x23：将4213#1配置到No.3通道。
下发0x24：将4213#1配置到No.4通道。
下发0x25：将4213#1配置到No.5通道。
下发0x26：将4213#1配置到No.6通道。
下发0x27：将4213#1配置到No.7通道。
下发0x28：将4213#1配置到No.8通道。

下发0x29：返回“0xFE”+“4213#1当前通道值”。
//////////////////////////////////
下发0x31：将4213#2配置到No.1通道。
下发0x32：将4213#2配置到No.2通道。
下发0x33：将4213#2配置到No.3通道。
下发0x34：将4213#2配置到No.4通道。
下发0x35：将4213#2配置到No.5通道。
下发0x36：将4213#2配置到No.6通道。
下发0x37：将4213#2配置到No.7通道。
下发0x38：将4213#2配置到No.8通道。

下发0x39：返回“0xFE”+“4213#2当前通道值”。
//////////////////////////////////
下发0x41：将4213#3配置到No.1通道。
下发0x42：将4213#3配置到No.2通道。
下发0x43：将4213#3配置到No.3通道。
下发0x44：将4213#3配置到No.4通道。
下发0x45：将4213#3配置到No.5通道。
下发0x46：将4213#3配置到No.6通道。
下发0x47：将4213#3配置到No.7通道。
下发0x48：将4213#3配置到No.8通道。

下发0x49：返回“0xFE”+“4213#3当前通道值”。
//////////////////////////////////
下发0x51：将4213#4配置到No.1通道。
下发0x52：将4213#4配置到No.2通道。
下发0x53：将4213#4配置到No.3通道。
下发0x54：将4213#4配置到No.4通道。
下发0x55：将4213#4配置到No.5通道。
下发0x56：将4213#4配置到No.6通道。
下发0x57：将4213#4配置到No.7通道。
下发0x58：将4213#4配置到No.8通道。

下发0x59：返回“0xFE”+“4213#4当前通道值”。
//////////////////////////////////
下发0xF1：返回“0xFF”+“4213#1温度”。
下发0xF2：返回“0xFF”+“4213#2温度”。
下发0xF3：返回“0xFF”+“4213#3温度”。
下发0xF4：返回“0xFF”+“4213#4温度”。
//////////////////////////////////
单片机上发0x21：ONU#1注册成功。
单片机上发0x22：ONU#2注册成功。
单片机上发0x23：ONU#3注册成功。
单片机上发0x24：ONU#4注册成功。
//////////////////////////////////
单片机定时上发：
“0xF1”+“4213#1温度”。
“0xF2”+“4213#2温度”。
“0xF3”+“4213#3温度”。
“0xF4”+“4213#4温度”。
//////////////////////////////////
只有光模块物理在位的情况下，相应的光模块才会上报温度以及波长。
**/
